import { News } from "../../../src/types";

export const index: News[] = [
  {
    "id": "rtfyguryfehbibviwew",
    "date": "2026/05/13",
    "title": "コントローラー接続ガイド",
    "abstruct": "コントローラー接続で問題が発生している方は、こちらのガイドをご覧ください。",
    "detail": "<p>コントローラー接続で問題が発生している方は、こちらのガイドをご確認ください。</p>\
<h3>コントローラーが認識されない</h3>\
<p>コントローラーが認識されない場合、以下の方法をお試しください。</p>\
<p>・無線接続の場合は、有線接続に切り替えてみてください。<br>\
・Steam経由での起動をお試しください。（左下「ゲームを追加」>「非Steamゲームを追加」>「参照」でダウンロードしたexeファイルを選択　ライブラリに追加されるので「プレイ」で起動）</p>\
<h3>Steam経由の起動でコントローラーの入力が2重になる</h3>\
<p>左上「Steam」>「設定」>「コントローラ」>「詳細設定を表示」>「XboxコントローラーのSteam入力を有効にする」をOFFにすると改善される場合があります。</p>",
    "tags": [],
    "files": []
  },
  {
    "id": "hduihuiwoajpdwiojpd",
    "date": "2026/05/13",
    "title": "v1.3.0をリリースしました",
    "abstruct": "最新のバージョンをリリースしました。ダウンロードページから最新版をダウンロードしてください。",
    "detail": "最新のバージョンをリリースしました。ダウンロードページから最新版をダウンロードしてください。<br><br><a href=\"../download\">ダウンロードページ</a><br><a href=\"../versions\">更新内容</a>",
    "tags": [],
    "files": []
  },
  {
    "id": "nfvheiojofwweffew",
    "date": "2026/03/20",
    "title": "v1.2.0をリリースしました",
    "abstruct": "最新のバージョンをリリースしました。ダウンロードページから最新版をダウンロードしてください。",
    "detail": "最新のバージョンをリリースしました。ダウンロードページから最新版をダウンロードしてください。<br><br><a href=\"../download\">ダウンロードページ</a><br><a href=\"../versions\">更新内容</a>",
    "tags": [],
    "files": []
  },
  {
    "id": "huuhriehufhiuhsi",
    "date": "2026/03/20",
    "title": "v1.1.0をリリースしました",
    "abstruct": "最新のバージョンをリリースしました。ダウンロードページから最新版をダウンロードしてください。",
    "detail": "最新のバージョンをリリースしました。ダウンロードページから最新版をダウンロードしてください。<br><br><a href=\"../download\">ダウンロードページ</a><br><a href=\"../versions\">更新内容</a>",
    "tags": [],
    "files": []
  },
  {
    "id": "jufwiejsnjnfoeifje",
    "date": "2026/03/19",
    "title": "サービスを開始しました",
    "abstruct": "本日より、ゲームをプレイできるようになりました。",
    "detail": "本日より、ゲームをプレイできるようになりました。<br>ダウンロード済みの方は、ゲームを起動すればすぐに遊べます。<br>大乱闘の世界をお楽しみください！",
    "tags": [],
    "files": []
  },
  {
    "id": "eryftvgedfwiuofh",
    "date": "2026/03/09",
    "title": "v1.0.0をリリースしました",
    "abstruct": "最初のバージョンをリリースしました。ダウンロードページから最新版をダウンロードしてください。",
    "detail": "最初のバージョンをリリースしました。ダウンロードページから最新版をダウンロードしてください。<br><br><a href=\"../download\">ダウンロードページ</a><br><a href=\"../versions\">更新内容</a>",
    "tags": [],
    "files": []
  },
  {
    "id": "abdhiudbcakiici",
    "date": "2026/03/09",
    "title": "ホームページを作成しました",
    "abstruct": "バーチャルスマッシュファンタジーの公式ホームページを作成しました。",
    "detail": "バーチャルスマッシュファンタジーの公式ホームページを作成しました。<br>ゲームのダウンロードやお問い合わせなどを行うことができます。",
    "tags": [],
    "files": []
  }
];